import React from "react";
import "./index.scss";

const Accordion = () => {
  return (
    <section className="section__accordion">
      <h3>Аккордеон</h3>
      <details>
        <summary>Аккордеон</summary>
        <p className="p_16">
          Я помню чудное мгновенье:
          <br />
          Передо мной явилась ты,
          <br />
          Как мимолетное виденье,
          <br />
          Как гений чистой красоты.
          <br />
          <br />
          В томленьях грусти безнадежной,
          <br />
          В тревогах шумной суеты,
          <br />
          Звучал мне долго голос нежный
          <br />
          И снились милые черты.
          <br />
          <br />
          Шли годы. Бурь порыв мятежный
          <br />
          Рассеял прежние мечты,
          <br />
          И я забыл твой голос нежный,
          <br />
          Твои небесные черты.
          <br />
          <br />
          В глуши, во мраке заточенья
          <br />
          Тянулись тихо дни мои
          <br />
          Без божества, без вдохновенья,
          <br />
          Без слез, без жизни, без любви.
          <br />
          <br />
          Душе настало пробужденье:
          <br />
          И вот опять явилась ты,
          <br />
          Как мимолетное виденье,
          <br />
          Как гений чистой красоты.
          <br />
          <br />
          И сердце бьется в упоенье,
          <br />
          И для него воскресли вновь
          <br />
          И божество, и вдохновенье,
          <br />И жизнь, и слезы, и любовь.
        </p>
      </details>
      <details>
        <summary>Аккордеон</summary>
        <p className="p_16">
          Гой ты, Русь, моя родная,
          <br />
          Хаты — в ризах образа...
          <br />
          Не видать конца и края —<br />
          Только синь сосет глаза.
          <br />
          <br />
          Как захожий богомолец,
          <br />
          Я смотрю твои поля.
          <br />
          А у низеньких околиц
          <br />
          Звонно чахнут тополя.
          <br />
          <br />
          Пахнет яблоком и медом
          <br />
          По церквам твой кроткий Спас.
          <br />
          И гудит за корогодом
          <br />
          На лугах веселый пляс.
          <br />
          <br />
          Побегу по мятой стежке
          <br />
          На приволь зеленых лех,
          <br />
          Мне навстречу, как сережки,
          <br />
          Прозвенит девичий смех.
          <br />
          <br />
          Если крикнет рать святая:
          <br />
          «Кинь ты Русь, живи в раю!»
          <br />
          Я скажу: «Не надо рая,
          <br />
          Дайте родину мою».
          <br />
        </p>
      </details>
      <details>
        <summary>Аккордеон</summary>
        <p className="p_16">
          Гоpдость полными вагонами золотыми погонами
          <br />
          С юга дyют молодые вет…
          <br />
          Pазpывая в клочья облака не забыли шлют из далека
          <br />
          С дома мама И не последняя любовь
          <br />
          А по небy бегyт видишь чьи-то следы
          <br />
          Это может быть ты это может быть я<br />
          Это может наш дрyг
          <br />
          Это может нам поют свои
        </p>
      </details>
    </section>
  );
};

export default Accordion;
